backend_communitree/app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
    def index
        locations = Location.all

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        location = Location.find(params[:id])