backend_communitree/app/controllers/skills_controller.rb

    def index
        skills = Skill.all
---
SELECT "skills".* FROM "skills"

    def show
        skill = Skill.find(params[:id])
---
SELECT "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]